prod-deploy/results/prod-01-5-rados-ec-vs-rep-mechanism-20260718-233945/cephfs-rep-baseline-clusternet-fixed/randread-1M-r2/fio.txt
storage_test: (g=0): rw=randread, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=128
...
fio-3.28
Starting 128 processes

storage_test: (groupid=0, jobs=128): err= 0: pid=4096011: Sun Jul 19 23:28:16 2026
  read: IOPS=5769, BW=5769MiB/s (6050MB/s)(1056GiB/187470msec)
    slat (usec): min=9, max=53094, avg=395.66, stdev=586.81
    clat (usec): min=111, max=16005k, avg=2834742.84, stdev=3018000.31
     lat (usec): min=506, max=16006k, avg=2835138.66, stdev=3018055.42
    clat percentiles (usec):
     |  1.00th=[    1385],  5.00th=[    1631], 10.00th=[    2024],
     | 20.00th=[    5276], 30.00th=[   20055], 40.00th=[  250610],
     | 50.00th=[ 1837106], 60.00th=[ 4076864], 70.00th=[ 4999611],
     | 80.00th=[ 5536482], 90.00th=[ 7012877], 95.00th=[ 8355054],
     | 99.00th=[ 9596568], 99.50th=[11609834], 99.90th=[14831059],
     | 99.95th=[15367930], 99.99th=[15770584]
   bw (  MiB/s): min=  159, max=10586, per=100.00%, avg=5888.26, stdev=11.61, samples=23166
   iops        : min=  270, max=13424, avg=5902.58, stdev=15.53, samples=46205
  lat (usec)   : 250=0.01%, 500=0.01%, 750=0.31%, 1000=0.11%
  lat (msec)   : 2=9.42%, 4=8.30%, 10=6.63%, 20=5.24%, 50=3.94%
  lat (msec)   : 100=1.90%, 250=4.13%, 500=3.99%, 750=2.03%, 1000=0.89%
  lat (msec)   : 2000=3.66%, >=2000=49.45%
  cpu          : usr=0.01%, sys=1.69%, ctx=1259950, majf=3, minf=4201871
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.2%, 32=0.4%, >=64=99.3%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=1081599,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: bw=5769MiB/s (6050MB/s), 5769MiB/s-5769MiB/s (6050MB/s-6050MB/s), io=1056GiB (1134GB), run=187470-187470msec